Lesson4/postit-lesson-4/app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 06 Dec 2014 06:01:46 UTC +00:00], ["name", "Sport"], ["updated_at", Sat, 06 Dec 2014 06:01:46 UTC +00:00]]

  def show
    @category = Category.find_by slug: (params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'sport' LIMIT 1