Lesson4/postit-lesson-4/app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = Comment.new(comment_params)
    @post.comments << @comment
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "This is a new comment. Yeahhh."], ["created_at", Sat, 06 Dec 2014 05:49:06 UTC +00:00], ["post_id", 1], ["updated_at", Sat, 06 Dec 2014 05:49:06 UTC +00:00]]

  def vote
    vote = Vote.create(voteable: Comment.find(params[:id]), creator: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 07 Dec 2014 00:06:01 UTC +00:00], ["updated_at", Sun, 07 Dec 2014 00:06:01 UTC +00:00], ["user_id", 3], ["vote", true], ["voteable_id", 3], ["voteable_type", "Comment"]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "3"]]