Lesson4/postit-lesson-4/app/controllers/posts_controller.rb

  def index
    @posts = Post.all.sort_by{ |p| p.total_votes }.reverse
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.creator = current_user

    if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 06 Dec 2014 05:13:52 UTC +00:00], ["description", "This is another post. Yay!"], ["title", "New post"], ["updated_at", Sat, 06 Dec 2014 05:13:52 UTC +00:00], ["url", "cnn.com"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["description", "This is my first post!!!"], ["updated_at", Sat, 06 Dec 2014 05:20:37 UTC +00:00]]

  def vote
    vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 06 Dec 2014 23:58:40 UTC +00:00], ["updated_at", Sat, 06 Dec 2014 23:58:40 UTC +00:00], ["user_id", 3], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]

  def set_post
    @post = Post.find_by slug: (params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'my-airport-story' LIMIT 1