Lesson4/postit-lesson-4/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "time_zone" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["time_zone", "London"], ["updated_at", Sun, 07 Dec 2014 15:00:49 EST -05:00]]
---
  def update
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."slug" = 'ingin' LIMIT 1
---
  def set_post
    @user = User.find_by slug: (params[:id])