Lesson3/postit-lesson-three/app/views/posts/_post.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]
---
    <br/>
    <small><%= link_to "#{post.comments.size} comments", post_path(post) %></small>