Lesson3/postit-lesson-three/app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 06 Dec 2014 06:01:46 UTC +00:00], ["name", "Sport"], ["updated_at", Sat, 06 Dec 2014 06:01:46 UTC +00:00]]