Lesson3/postit-lesson-three/app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "This is a new comment. Yeahhh."], ["created_at", Sat, 06 Dec 2014 05:49:06 UTC +00:00], ["post_id", 1], ["updated_at", Sat, 06 Dec 2014 05:49:06 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = Comment.new(comment_params)
    @post.comments << @comment