Lesson3/postit-lesson-three/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.creator = current_user

    if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 06 Dec 2014 05:13:52 UTC +00:00], ["description", "This is another post. Yay!"], ["title", "New post"], ["updated_at", Sat, 06 Dec 2014 05:13:52 UTC +00:00], ["url", "cnn.com"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["description", "This is my first post!!!"], ["updated_at", Sat, 06 Dec 2014 05:20:37 UTC +00:00]]