Lesson4/postit-lesson-4/app/views/posts/_post.html.erb

    <br/>
    <small><%= link_to "#{post.comments.size} comments", post_path(post) %></small>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]